FastLED/FastLED/src/platforms/arm/stm32/spi_hw_2_stm32.cpp
/// @file spi_hw_2_stm32.cpp
/// @brief STM32 implementation of Dual-SPI using GPIO + Timer + DMA
///
/// This file provides the SPIDualSTM32 class and factory for STM32 platforms.
/// Uses Timer for clock generation + DMA for parallel data output on GPIO pins.
/// All class definition and implementation is contained in this single file.
///
/// Hardware approach:
/// - Timer peripheral generates clock signal on one GPIO pin
/// - Two DMA channels push data to two separate GPIO pins (D0, D1)
/// - Timer triggers DMA transfers at configured SPI clock rate
///
///
/// Compatible with: STM32F1, STM32F2, STM32F4, STM32F7, STM32L4, STM32H7, STM32G4, STM32U5

#include "platforms/is_platform.h"

#ifdef FL_IS_STM32

// Platform detection and capability macros
#include "platforms/arm/stm32/stm32_capabilities.h"

#ifdef FL_STM32_HAS_SPI_HW_2

// ============================================================================
// Hardware SPI Support Guard
// ============================================================================
// Only compile this hardware implementation if FL_STM32_HAS_SPI_HW_2 is defined.
// If undefined (e.g., on STM32F1 with channel-based DMA), the weak binding
// will cause FastLED to fall back to software bitbang implementation.
//
// FL_STM32_HAS_SPI_HW_2 is defined in stm32_capabilities.h for platforms with:
// - Stream-based DMA (F2/F4/F7/H7/L4)
//
// Not defined for:
// - F1 (channel-based DMA - not yet implemented)
// - G4 (channel-based DMA with DMAMUX - not yet implemented)
// - U5 (GPDMA architecture - not yet implemented)

#include <cstdint>  // For UINT32_MAX
#include <Arduino.h>  // Ensure STM32 HAL is initialized

#include "platforms/shared/spi_hw_2.h"
#include "fl/warn.h"
#include "fl/dbg.h"
#include "fl/cstring.h"

// Allow software-mode testing without hardware Timer/DMA
// Define this to enable software GPIO bitbanging mode for testing
// #define FASTLED_STM32_DUALSPI_SOFTWARE_MODE 1

#include <cstring> // ok include
#include "platforms/shared/spi_bus_manager.h"  // For DMABuffer, TransmitMode, SPIError
#include "platforms/arm/stm32/stm32_gpio_timer_helpers.h"  // Centralized GPIO/Timer/DMA helpers

namespace fl {

// Use centralized STM32 helper functions
using namespace fl::stm32;

// ============================================================================
// SPIDualSTM32 Class Implementation
// ============================================================================

// ============================================================================

/// STM32 hardware driver for Dual-SPI DMA transmission using GPIO+Timer+DMA
///
/// Implements SpiHw2 interface for STM32 platforms using:
/// - Timer peripheral (TIM2/TIM3/etc) for clock generation
/// - DMA channels for non-blocking asynchronous transfers
/// - GPIO pins for clock and dual data lanes
/// - Configurable clock frequency
///
/// @note Each instance allocates one Timer peripheral and two DMA channels
/// @note Data pins can be any available GPIO pins (flexible pin assignment)
class SPIDualSTM32 : public SpiHw2 {
public:
    /// @brief Construct a new SPIDualSTM32 controller
    /// @param bus_id Logical bus identifier (0, 1, etc.)
    /// @param name Human-readable name for this controller
    explicit SPIDualSTM32(int bus_id = -1, const char* name = "Unknown");

    /// @brief Destroy the controller and release all resources
    ~SPIDualSTM32();

    /// @brief Initialize the SPI controller with specified configuration
    /// @param config Configuration including pins, clock speed, and bus number
    /// @return true if initialization successful, false on error
    /// @note Validates pin assignments and allocates Timer/DMA resources
    bool begin(const SpiHw2::Config& config) override;

    /// @brief Deinitialize the controller and release resources
    void end() override;

    /// @brief Acquire DMA buffer for direct user writes (zero-copy)
    /// @param bytes_per_lane Number of bytes per lane (total = bytes_per_lane * 2)
    /// @return DMABuffer containing buffer span or error
    /// @note Auto-waits if previous transmission still active
    DMABuffer acquireDMABuffer(size_t bytes_per_lane) override;

    /// @brief Start non-blocking transmission of previously acquired DMA buffer
    /// @return true if transfer started successfully, false on error
    /// @note Must call acquireDMABuffer() first
    /// @note Returns immediately - use waitComplete() to block until done
    bool transmit(TransmitMode mode = TransmitMode::ASYNC) override;

    /// @brief Wait for current transmission to complete
    /// @param timeout_ms Maximum time to wait in milliseconds (UINT32_MAX = infinite)
    /// @return true if transmission completed, false on timeout
    bool waitComplete(uint32_t timeout_ms = UINT32_MAX) override;

    /// @brief Check if transmission is currently in progress
    /// @return true if busy, false if idle
    bool isBusy() const override;

    /// @brief Check if controller has been initialized
    /// @return true if initialized, false otherwise
    bool isInitialized() const override;

    /// @brief Get the bus identifier for this controller
    /// @return Bus ID (0, 1, etc.)
    int getBusId() const override;

    /// @brief Get the human-readable name for this controller
    /// @return Controller name string
    const char* getName() const override;

private:
    /// @brief Release all allocated resources (Timer, DMA, buffers)
    void cleanup();

    /// @brief Allocate or resize internal DMA buffer
    /// @param required_size Size needed in bytes
    /// @return true if buffer allocated successfully
    bool allocateDMABuffer(size_t required_size);

    /// @brief Interleave buffer data for dual-lane transmission
    /// @param src Source buffer (linear byte array)
    /// @param src_len Source buffer length in bytes
    /// @param dst0 Destination buffer for lane 0 (odd bits)
    /// @param dst1 Destination buffer for lane 1 (even bits)
    /// @param dst_len Destination buffer length (will be src_len * 4 bits per byte / 2 lanes = src_len * 2 bytes)
    void interleaveBits(const uint8_t* src, size_t src_len, uint8_t* dst0, uint8_t* dst1, size_t dst_len);

    int mBusId;  ///< Logical bus identifier
    const char* mName;

    // Hardware resources
    TIM_TypeDef* mTimer;  ///< Timer peripheral for clock generation
#ifdef HAL_TIM_MODULE_ENABLED
    TIM_HandleTypeDef mTimerHandle;  ///< HAL handle for timer (persistent storage)
#endif
#ifdef FASTLED_STM32_HAS_DMA_STREAMS
    DMA_Stream_TypeDef* mDMAStream0;  ///< DMA stream for lane 0
    DMA_Stream_TypeDef* mDMAStream1;  ///< DMA stream for lane 1
#ifdef HAL_DMA_MODULE_ENABLED
    DMA_HandleTypeDef mDMAHandle0;  ///< HAL handle for DMA stream 0 (persistent storage)
    DMA_HandleTypeDef mDMAHandle1;  ///< HAL handle for DMA stream 1 (persistent storage)
#endif
#endif

    // DMA buffer management (zero-copy API)
    fl::span<uint8_t> mDMABuffer;    ///< Allocated DMA buffer (interleaved format for dual-lane)
    size_t mMaxBytesPerLane;         ///< Max bytes per lane we've allocated for
    size_t mCurrentTotalSize;        ///< Current transmission size (bytes_per_lane * 2)
    bool mBufferAcquired;            ///< True if buffer acquired and ready for transmit

    // Legacy buffers (will be derived from mDMABuffer for lane splitting)
    void* mDMABuffer0;      ///< Buffer for lane 0 (derived from mDMABuffer)
    void* mDMABuffer1;      ///< Buffer for lane 1 (derived from mDMABuffer)
    size_t mDMABufferSize;  ///< Size of each DMA buffer (derived)

    // State
    bool mTransactionActive;
    bool mInitialized;

    // Configuration
    uint8_t mClockPin;
    uint8_t mData0Pin;
    uint8_t mData1Pin;
    uint32_t mClockSpeedHz;

    SPIDualSTM32(const SPIDualSTM32&) = delete;
    SPIDualSTM32& operator=(const SPIDualSTM32&) = delete;
};

// ============================================================================
// SPIDualSTM32 Implementation
// ============================================================================

SPIDualSTM32::SPIDualSTM32(int bus_id, const char* name)
    : mBusId(bus_id)
    , mName(name)
    , mTimer(nullptr)
#ifdef FASTLED_STM32_HAS_DMA_STREAMS
    , mDMAStream0(nullptr)
    , mDMAStream1(nullptr)
#endif
    , mDMABuffer()
    , mMaxBytesPerLane(0)
    , mCurrentTotalSize(0)
    , mBufferAcquired(false)
    , mDMABuffer0(nullptr)
    , mDMABuffer1(nullptr)
    , mDMABufferSize(0)
    , mTransactionActive(false)
    , mInitialized(false)
    , mClockPin(0)
    , mData0Pin(0)
    , mData1Pin(0)
    , mClockSpeedHz(0) {
}

SPIDualSTM32::~SPIDualSTM32() {
    cleanup();
}

bool SPIDualSTM32::begin(const SpiHw2::Config& config) {
    if (mInitialized) {
        return true;  // Already initialized
    }

    // Validate bus_num against mBusId if driver has pre-assigned ID
    if (mBusId != -1 && config.bus_num != static_cast<uint8_t>(mBusId)) {
        FL_WARN("SPIDualSTM32: Bus ID mismatch");
        return false;
    }

