FastLED/FastLED/src/platforms/arm/stm32/spi_hw_2_stm32.cpp
    // Validate pin assignments
    if (config.clock_pin < 0 || config.data0_pin < 0 || config.data1_pin < 0) {
        FL_WARN("SPIDualSTM32: Invalid pin configuration");
        return false;
    }

    // Store pin configuration
    mClockPin = config.clock_pin;
    mData0Pin = config.data0_pin;
    mData1Pin = config.data1_pin;
    mClockSpeedHz = config.clock_speed_hz;

    // Validate pins using GPIO helper functions
    if (!isValidPin(mClockPin)) {
        FL_WARN("SPIDualSTM32: Invalid clock pin " << static_cast<int>(mClockPin));
        return false;
    }
    if (!isValidPin(mData0Pin)) {
        FL_WARN("SPIDualSTM32: Invalid data0 pin " << static_cast<int>(mData0Pin));
        return false;
    }
    if (!isValidPin(mData1Pin)) {
        FL_WARN("SPIDualSTM32: Invalid data1 pin " << static_cast<int>(mData1Pin));
        return false;
    }

    // Configure GPIO pins
#ifdef HAL_GPIO_MODULE_ENABLED
    // Configure data pins as outputs
    if (!configurePinAsOutput(mData0Pin, GPIO_SPEED_FREQ_HIGH)) {
        FL_WARN("SPIDualSTM32: Failed to configure data0 pin");
        return false;
    }
    if (!configurePinAsOutput(mData1Pin, GPIO_SPEED_FREQ_HIGH)) {
        FL_WARN("SPIDualSTM32: Failed to configure data1 pin");
        return false;
    }

    FL_DBG("SPIDualSTM32: GPIO pins configured successfully");
    FL_DBG("  Clock pin: " << static_cast<int>(mClockPin));
    FL_DBG("  Data0 pin: " << static_cast<int>(mData0Pin));
    FL_DBG("  Data1 pin: " << static_cast<int>(mData1Pin));
#endif

    // Configure Timer for clock generation
#ifdef HAL_TIM_MODULE_ENABLED
    // Select timer based on bus_id
    mTimer = selectTimer(mBusId);
    if (mTimer == nullptr) {
        FL_WARN("SPIDualSTM32: Failed to select timer for bus " << mBusId);
        return false;
    }

    // Initialize timer for PWM clock generation
    if (!initTimerPWM(&mTimerHandle, mTimer, mClockSpeedHz)) {
        FL_WARN("SPIDualSTM32: Failed to initialize timer PWM");
        mTimer = nullptr;
        return false;
    }

    // Configure clock pin as timer alternate function
    if (!configurePinAsTimerAF(mClockPin, mTimer, FASTLED_GPIO_SPEED_MAX)) {
        FL_WARN("SPIDualSTM32: Failed to configure clock pin as timer AF");
        mTimer = nullptr;
        return false;
    }

    FL_DBG("SPIDualSTM32: Timer configured successfully");
    FL_DBG("  Timer: TIM" << ((mTimer == TIM2) ? "2" : (mTimer == TIM3) ? "3" : (mTimer == TIM4) ? "4"
#ifdef FASTLED_STM32_HAS_TIM5
         : (mTimer == TIM5) ? "5"
#endif
         : "?"));
    FL_DBG("  Clock speed: " << mClockSpeedHz << " Hz");
#endif

    // Configure DMA streams for data lanes
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    // Select DMA streams for both lanes
    mDMAStream0 = getDMAStream(mTimer, mBusId, 0);
    mDMAStream1 = getDMAStream(mTimer, mBusId, 1);

    if (mDMAStream0 == nullptr || mDMAStream1 == nullptr) {
        FL_WARN("SPIDualSTM32: Failed to select DMA streams for bus " << mBusId);
        mTimer = nullptr;
        mDMAStream0 = nullptr;
        mDMAStream1 = nullptr;
        return false;
    }

    // Get DMA channel number for timer update event
    uint32_t dma_channel = getDMAChannel(mTimer);
    if (dma_channel == 0xFF) {
        FL_WARN("SPIDualSTM32: Failed to get DMA channel for timer");
        mTimer = nullptr;
        mDMAStream0 = nullptr;
        mDMAStream1 = nullptr;
        return false;
    }

    // Enable DMA clocks
    enableDMAClock(getDMAController(mDMAStream0));
    enableDMAClock(getDMAController(mDMAStream1));

    FL_DBG("SPIDualSTM32: DMA streams selected successfully");
    FL_DBG("  Stream 0: " << (void*)mDMAStream0);
    FL_DBG("  Stream 1: " << (void*)mDMAStream1);
    FL_DBG("  DMA channel: " << dma_channel);

    // Note: DMA stream configuration (addresses, sizes) happens in transmit()
    // because we need to know the buffer addresses and sizes at that time.
    // Here we just allocate the streams and verify they're available.
#else
    FL_WARN("SPIDualSTM32: DMA not supported on this platform");
    mTimer = nullptr;
    return false;
#endif

    // Hardware initialization complete
    mInitialized = true;
    mTransactionActive = false;

    FL_DBG("SPIDualSTM32: Hardware initialization complete");
    return true;
}

void SPIDualSTM32::end() {
    cleanup();
}

DMABuffer SPIDualSTM32::acquireDMABuffer(size_t bytes_per_lane) {
    if (!mInitialized) {
        return DMABuffer(SPIError::NOT_INITIALIZED);
    }

    // Auto-wait if previous transmission still active
    if (mTransactionActive) {
        if (!waitComplete()) {
            return DMABuffer(SPIError::BUSY);
        }
    }

    // For dual-lane SPI: total size = bytes_per_lane × 2 (interleaved)
    constexpr size_t num_lanes = 2;
    const size_t total_size = bytes_per_lane * num_lanes;

    // STM32 doesn't have a specific max size limit like ESP32, but validate reasonable size
    // Use 256KB as a practical limit for embedded systems
    constexpr size_t MAX_SIZE = 256 * 1024;
    if (total_size > MAX_SIZE) {
        return DMABuffer(SPIError::BUFFER_TOO_LARGE);
    }

    // Reallocate buffer only if we need more capacity
    if (bytes_per_lane > mMaxBytesPerLane) {
        if (!mDMABuffer.empty()) {
            free(mDMABuffer.data());
            mDMABuffer = fl::span<uint8_t>();
        }

        // Allocate DMA-capable memory (regular malloc for STM32)
        uint8_t* ptr = static_cast<uint8_t*>(malloc(total_size));
        if (!ptr) {
            return DMABuffer(SPIError::ALLOCATION_FAILED);
        }

        mDMABuffer = fl::span<uint8_t>(ptr, total_size);
        mMaxBytesPerLane = bytes_per_lane;
    }

    mBufferAcquired = true;
    mCurrentTotalSize = total_size;

    // Return DMABuffer constructed from size
    return DMABuffer(total_size);
}

bool SPIDualSTM32::allocateDMABuffer(size_t required_size) {
    if (mDMABufferSize >= required_size) {
        return true;  // Buffers are already large enough
    }

    // Free old buffers if they exist
    if (mDMABuffer0 != nullptr) {
        free(mDMABuffer0);
        mDMABuffer0 = nullptr;
    }
    if (mDMABuffer1 != nullptr) {
        free(mDMABuffer1);
        mDMABuffer1 = nullptr;
    }
    mDMABufferSize = 0;

    // Allocate new buffers (word-aligned for DMA requirements)
    // Using malloc with alignment - consider using aligned_alloc() or memalign() if available
    mDMABuffer0 = malloc(required_size);
    if (mDMABuffer0 == nullptr) {
        FL_WARN("SPIDualSTM32: Failed to allocate DMA buffer 0");
        return false;
    }

    mDMABuffer1 = malloc(required_size);
    if (mDMABuffer1 == nullptr) {
        FL_WARN("SPIDualSTM32: Failed to allocate DMA buffer 1");
        free(mDMABuffer0);
        mDMABuffer0 = nullptr;
        return false;
    }

    mDMABufferSize = required_size;
    return true;
}

void SPIDualSTM32::interleaveBits(const uint8_t* src, size_t src_len,
                                   uint8_t* dst0, uint8_t* dst1, size_t dst_len) {
    // Interleave bits from source bytes across two lanes
    // Lane 0 (dst0) gets: bits 7, 5, 3, 1 from each byte
    // Lane 1 (dst1) gets: bits 6, 4, 2, 0 from each byte
    //
    // Example: Input byte 0xB4 = 10110100
    //   Lane 0: bits [7,5,3,1] = [1,1,1,0] = 0xE (in nibble)
    //   Lane 1: bits [6,4,2,0] = [0,1,0,0] = 0x4 (in nibble)

    (void)dst_len;  // Unused parameter, kept for interface consistency

