FastLED/FastLED/src/platforms/arm/stm32/spi_hw_2_stm32.cpp
    for (size_t i = 0; i < src_len; i++) {
        uint8_t byte = src[i];

        // Extract odd bits (7, 5, 3, 1) for lane 0
        uint8_t lane0_bits = 0;
        lane0_bits |= ((byte >> 7) & 1) << 3;  // Bit 7 -> position 3
        lane0_bits |= ((byte >> 5) & 1) << 2;  // Bit 5 -> position 2
        lane0_bits |= ((byte >> 3) & 1) << 1;  // Bit 3 -> position 1
        lane0_bits |= ((byte >> 1) & 1) << 0;  // Bit 1 -> position 0

        // Extract even bits (6, 4, 2, 0) for lane 1
        uint8_t lane1_bits = 0;
        lane1_bits |= ((byte >> 6) & 1) << 3;  // Bit 6 -> position 3
        lane1_bits |= ((byte >> 4) & 1) << 2;  // Bit 4 -> position 2
        lane1_bits |= ((byte >> 2) & 1) << 1;  // Bit 2 -> position 1
        lane1_bits |= ((byte >> 0) & 1) << 0;  // Bit 0 -> position 0

        // Store nibbles (4 bits per lane per byte)
        // Pack 2 nibbles per destination byte
        if (i % 2 == 0) {
            // First nibble of destination byte (high nibble)
            dst0[i / 2] = lane0_bits << 4;
            dst1[i / 2] = lane1_bits << 4;
        } else {
            // Second nibble of destination byte (low nibble)
            dst0[i / 2] |= lane0_bits;
            dst1[i / 2] |= lane1_bits;
        }
    }
}

bool SPIDualSTM32::transmit(TransmitMode mode) {
    if (!mInitialized || !mBufferAcquired) {
        return false;
    }

    // Mode is a hint - platform may block
    (void)mode;

    if (mCurrentTotalSize == 0) {
        return true;  // Nothing to transmit
    }

    // Calculate buffer size for each lane from interleaved buffer
    // Each byte splits into 4 bits per lane
    // 2 source bytes = 8 bits per lane = 1 byte per lane
    size_t buffer_size_per_lane = (mCurrentTotalSize + 1) / 2;  // Round up

    if (!allocateDMABuffer(buffer_size_per_lane)) {
        return false;
    }

    // Clear buffers
    fl::memset(mDMABuffer0, 0, buffer_size_per_lane);
    fl::memset(mDMABuffer1, 0, buffer_size_per_lane);

    // Interleave bits from mDMABuffer across two lanes
    interleaveBits(mDMABuffer.data(), mCurrentTotalSize,
                   (uint8_t*)mDMABuffer0, (uint8_t*)mDMABuffer1,
                   buffer_size_per_lane);

    // Start DMA transfers and timer
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    // Get GPIO ODR register addresses for DMA destination
    GPIO_TypeDef* port0 = getGPIOPort(mData0Pin);
    GPIO_TypeDef* port1 = getGPIOPort(mData1Pin);

    if (port0 == nullptr || port1 == nullptr) {
        FL_WARN("SPIDualSTM32: Failed to get GPIO ports for data pins");
        return false;
    }

    // Get DMA channel number for timer update event
    uint32_t dma_channel = getDMAChannel(mTimer);
    if (dma_channel == 0xFF) {
        FL_WARN("SPIDualSTM32: Failed to get DMA channel for timer");
        return false;
    }

    // Clear any pending DMA flags before starting
    clearDMAFlags(mDMAStream0);
    clearDMAFlags(mDMAStream1);

    // Configure and start DMA stream 0 (lane 0)
    volatile void* odr0 = (volatile void*)&port0->ODR;
    if (!initDMA(mDMAStream0, mDMABuffer0, odr0, buffer_size_per_lane, dma_channel)) {
        FL_WARN("SPIDualSTM32: Failed to initialize DMA stream 0");
        return false;
    }

    // Configure and start DMA stream 1 (lane 1)
    volatile void* odr1 = (volatile void*)&port1->ODR;
    if (!initDMA(mDMAStream1, mDMABuffer1, odr1, buffer_size_per_lane, dma_channel)) {
        FL_WARN("SPIDualSTM32: Failed to initialize DMA stream 1");
        stopDMA(mDMAStream0);  // Stop stream 0 since we're aborting
        return false;
    }

    // Enable DMA requests from timer update event
    TIM_HandleTypeDef htim = {};
    htim.Instance = mTimer;
    __HAL_TIM_ENABLE_DMA(&htim, TIM_DMA_UPDATE);

    // Start timer PWM to trigger DMA transfers
    if (!startTimer(&mTimerHandle)) {
        FL_WARN("SPIDualSTM32: Failed to start timer");
        stopDMA(mDMAStream0);
        stopDMA(mDMAStream1);
        __HAL_TIM_DISABLE_DMA(&htim, TIM_DMA_UPDATE);
        return false;
    }

    FL_DBG("SPIDualSTM32: DMA transmission started");
    FL_DBG("  Buffer size per lane: " << buffer_size_per_lane << " bytes");
    FL_DBG("  Total bytes: " << mCurrentTotalSize);

    mTransactionActive = true;
    return true;
#else
    FL_WARN("SPIDualSTM32: DMA not supported on this platform");
    return false;
#endif
}

bool SPIDualSTM32::waitComplete(uint32_t timeout_ms) {
    if (!mTransactionActive) {
        return true;  // Nothing to wait for
    }

    // Wait for DMA completion with timeout
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    // Record start time for timeout checking
    uint32_t start_ms = millis();
    bool timeout_enabled = (timeout_ms != UINT32_MAX);

    // Poll DMA completion flags for both streams
    while (true) {
        bool stream0_complete = isDMAComplete(mDMAStream0);
        bool stream1_complete = isDMAComplete(mDMAStream1);

        // Check if both streams completed
        if (stream0_complete && stream1_complete) {
            FL_DBG("SPIDualSTM32: DMA transfer complete");
            break;
        }

        // Check timeout
        if (timeout_enabled) {
            uint32_t elapsed_ms = millis() - start_ms;
            if (elapsed_ms >= timeout_ms) {
                FL_WARN("SPIDualSTM32: DMA transfer timeout after " << elapsed_ms << " ms");

                // Emergency stop: disable DMA and timer
                stopDMA(mDMAStream0);
                stopDMA(mDMAStream1);
                stopTimer(&mTimerHandle);

                // Disable timer DMA requests
                TIM_HandleTypeDef htim = {};
                htim.Instance = mTimer;
                __HAL_TIM_DISABLE_DMA(&htim, TIM_DMA_UPDATE);

                mTransactionActive = false;
                mBufferAcquired = false;
                mCurrentTotalSize = 0;
                return false;
            }
        }

        // Small delay to avoid busy-waiting too aggressively
        // This allows other tasks to run if RTOS is present
        delayMicroseconds(10);
    }

    // Stop timer (DMA transfers are complete)
    stopTimer(&mTimerHandle);

    // Disable timer DMA requests
    TIM_HandleTypeDef htim = {};
    htim.Instance = mTimer;
    __HAL_TIM_DISABLE_DMA(&htim, TIM_DMA_UPDATE);

