FastLED/FastLED/src/platforms/arm/stm32/spi_hw_2_stm32.cpp
    // Clear DMA flags
    clearDMAFlags(mDMAStream0);
    clearDMAFlags(mDMAStream1);

    FL_DBG("SPIDualSTM32: Timer and DMA stopped successfully");

    mTransactionActive = false;

    // AUTO-RELEASE DMA buffer
    mBufferAcquired = false;
    mCurrentTotalSize = 0;

    return true;
#else
    (void)timeout_ms;
    mTransactionActive = false;
    mBufferAcquired = false;
    mCurrentTotalSize = 0;
    return true;
#endif
}

bool SPIDualSTM32::isBusy() const {
    if (!mInitialized) {
        return false;
    }

    // TODO: Check DMA channel busy status
    // return mTransactionActive || DMA_channel0_busy || DMA_channel1_busy;

    return mTransactionActive;
}

bool SPIDualSTM32::isInitialized() const {
    return mInitialized;
}

int SPIDualSTM32::getBusId() const {
    return mBusId;
}

const char* SPIDualSTM32::getName() const {
    return mName;
}

void SPIDualSTM32::cleanup() {
    if (mInitialized) {
        // Wait for any pending transmission
        if (mTransactionActive) {
            waitComplete();
        }

        //  Stop hardware resources in reverse order of initialization
        // 1. Stop DMA streams
        // 2. Stop Timer
        // 3. Reset GPIO pins (optional - not critical)

        // Stop DMA streams if initialized
#ifdef FASTLED_STM32_HAS_DMA_STREAMS
        if (mDMAStream0 != nullptr) {
            stopDMA(mDMAStream0);
            mDMAStream0 = nullptr;
        }
        if (mDMAStream1 != nullptr) {
            stopDMA(mDMAStream1);
            mDMAStream1 = nullptr;
        }
#endif

        // Stop timer if initialized
        if (mTimer != nullptr) {
            stopTimer(&mTimerHandle);
            mTimer = nullptr;
        }

        // Free main DMA buffer
        if (!mDMABuffer.empty()) {
            free(mDMABuffer.data());
            mDMABuffer = fl::span<uint8_t>();
            mMaxBytesPerLane = 0;
            mCurrentTotalSize = 0;
            mBufferAcquired = false;
        }

        // Free legacy DMA buffers
        if (mDMABuffer0 != nullptr) {
            free(mDMABuffer0);
            mDMABuffer0 = nullptr;
        }
        if (mDMABuffer1 != nullptr) {
            free(mDMABuffer1);
            mDMABuffer1 = nullptr;
        }
        mDMABufferSize = 0;

        mInitialized = false;
    }
}

// ============================================================================
// Factory Implementation
// ============================================================================

/// STM32 factory override - returns available SPI bus instances
/// Strong definition overrides weak default
fl::vector<SpiHw2*> SpiHw2::createInstances() {
    fl::vector<SpiHw2*> controllers;

    // Create logical SPI buses based on available Timer/DMA resources
    // For initial implementation, we provide 2 potential buses
    // Actual availability depends on:
    // - Timer peripherals available (TIM2, TIM3, TIM4, etc.)
    // - DMA channels available (2 per bus)
    // - GPIO pins available

    static SPIDualSTM32 controller0(0, "DSPI0");
    controllers.push_back(&controller0);

    static SPIDualSTM32 controller1(1, "DSPI1");
    controllers.push_back(&controller1);

    // Additional controllers can be added if hardware supports:
    // static SPIDualSTM32 controller2(2, "DSPI2");
    // controllers.push_back(&controller2);

    return controllers;
}

}  // namespace fl

#endif  // FL_STM32_HAS_SPI_HW_2

#endif  // FL_IS_STM32
